# Чтение и запись данных

## Урок 2. Чтение данных в формате CSV

CSV (Comma-Separated Values, значения, разделённые запятыми) — текстовый файл, позволяющий хранить табличные данные. Каждая строка файла представляет собой строку таблицы, а столбцы внутри каждой таблицы разделены запятыми.

### Чтение файла

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('2-1.csv')
df.head()

         Date Country    State        City  AvgTemperature
0  2012-01-01      US  Alabama  Birmingham            59.1
1  2012-01-02      US  Alabama  Birmingham            43.0
2  2012-01-03      US  Alabama  Birmingham            30.9
3  2012-01-04      US  Alabama  Birmingham            34.7
4  2012-01-05      US  Alabama  Birmingham            44.1

In [ ]:
df = pd.read_csv('2-2.csv', sep=';')
df.head()

         Date Country    State        City  AvgTemperature
0  2012-01-01      US  Alabama  Birmingham            59.1
1  2012-01-02      US  Alabama  Birmingham            43.0
2  2012-01-03      US  Alabama  Birmingham            30.9
3  2012-01-04      US  Alabama  Birmingham            34.7
4  2012-01-05      US  Alabama  Birmingham            44.1

In [ ]:
df = pd.read_csv('2-3.csv')
df.head()

   index        Date Country    State        City  AvgTemperature
0  44300  2012-01-01      US  Alabama  Birmingham            59.1
1  44301  2012-01-02      US  Alabama  Birmingham            43.0
2  44302  2012-01-03      US  Alabama  Birmingham            30.9
3  44303  2012-01-04      US  Alabama  Birmingham            34.7
4  44304  2012-01-05      US  Alabama  Birmingham            44.1

In [ ]:
df = pd.read_csv('2-3.csv', index_col='index')
df.head()

             Date Country    State        City  AvgTemperature
index
44300  2012-01-01      US  Alabama  Birmingham            59.1
44301  2012-01-02      US  Alabama  Birmingham            43.0
44302  2012-01-03      US  Alabama  Birmingham            30.9
44303  2012-01-04      US  Alabama  Birmingham            34.7
44304  2012-01-05      US  Alabama  Birmingham            44.1

In [ ]:
df = pd.read_csv('2-4.csv', index_col=0)
df.head()

         Date Country    State        City  AvgTemperature
0  2012-01-01      US  Alabama  Birmingham            59.1
1  2012-01-02      US  Alabama  Birmingham            43.0
2  2012-01-03      US  Alabama  Birmingham            30.9
3  2012-01-04      US  Alabama  Birmingham            34.7
4  2012-01-05      US  Alabama  Birmingham            44.1